//
//  JobSearchResultViewController.swift
//  myJobSearch
//
//  Created by chang on 2017/7/14.
//  Copyright © 2017年 chang. All rights reserved.
//

import UIKit

class JobSearchResultViewController: UITableViewController {
    
    
    @IBOutlet weak var lblJobTop: UILabel!
    @IBOutlet weak var lblJobSalary: UILabel!
    @IBOutlet weak var lblJobLocation: UILabel!
    var currentRow = 0
    var db:OpaquePointer? = nil
    var vcTop = ViewController()
    
    var searchJob = ""
    var searchSalary = ""
    var searchSalarySql = ""
    var searchLocation = ""
    var searchJobNo = ""
    var dicRow = [String:Any?]()
    var resultJob = [[String:Any?]]()
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        self.navigationController?.navigationBar.isHidden = false
        
        if let appDelegate = UIApplication.shared.delegate as? AppDelegate{
            db = appDelegate.getDB()
        }
        
        //searchJob = vcTop.txtJob.text!
        searchSalary = vcTop.searchSalary
        searchSalarySql = String(searchSalary.characters.prefix(2))
        searchLocation = vcTop.searchLocation
        searchJobNo = vcTop.searchJobNo
        
        lblJobTop.text = vcTop.txtJob.text
        lblJobSalary.text = vcTop.txtSalary.text
        lblJobLocation.text = vcTop.searchLocation
        //getSql()
        getResultJob()
        // Do any additional setup after loading the view.
        
        self.navigationController?.navigationBar.backgroundColor = UIColor(red: 0, green: (117/255), blue: (33/255), alpha: 0.6)

    }
    
    //一直蓋不掉，在這邊終於可以蓋掉
    override func viewDidAppear(_ animated: Bool) {
        //let nav = self.navigationController?.navigationBar
        //nav?.barStyle = UIBarStyle.black
        //nav?.tintColor = UIColor.white
        
        //這用不到nav?.titleTextAttributes = [NSForegroundColorAttributeName: UIColor.orange]

    }


    

    func getSql(){
        //執行sql指令
        let sql = "select JSI.job, C.name, JD.description,JD.others,JD.invoice from job_structured_info JSI,companies C,job_description JD, district D where D.district_no = JSI.addr_no and JD.jobno = JSI.jobno and JSI.invoice = C.invoice and JSI.salary_low > '\(searchSalarySql)' and (JSI.jobcat1 = '\(searchJobNo)' or JSI.jobcat2 = '\(searchJobNo)' or JSI.jobcat3 = '\(searchJobNo)') and D.district_name like '\(searchLocation)'"
               print(sql)
        /*"SELECT jobcat1,jobcat2,jobcat3,salary_low,addr_no FROM job_structured_info where substr(yvtc_num,1,6) = '' and substr(yvtc_num,7,1) != '0' and substr (yvtc_num,length(yvtc_num)-1,2) = '00';")
         */
        //print(sql!)
        
        //第二層  Where substr(yvtc_num,5,3) <> '000' and substr(yvtc_num,8,3) = '000'
        //第三層  Where substr(yvtc_num,5,3) <> '000' and substr(yvtc_num,8,3) <> '000'
        let cSql = sql.cString(using: .utf8)
        
        var statement:OpaquePointer? = nil
        
        sqlite3_prepare(db, cSql!, -1, &statement, nil)
        
        while sqlite3_step(statement) == SQLITE_ROW{
            let cJobName :String
            let cJobDesc : String
            let cJobOther: String
            let cJobInvoice: String
            
            let job_title = sqlite3_column_text(statement, 0)
            let cJobTitle = String(cString: job_title!)
            if let job_name = sqlite3_column_text(statement, 1){
                cJobName = String(cString: job_name)
            }else{
                cJobName = ""
            }
            //怕有空值，使用if let
            if let job_desc = sqlite3_column_text(statement, 2){
                cJobDesc = String(cString: job_desc)
            }else{
                cJobDesc = ""
            }
            if let job_other = sqlite3_column_text(statement, 3){
                cJobOther = String(cString: job_other)
            }else{
                cJobOther = ""
            }
            if let job_invoice = sqlite3_column_text(statement, 4){
                cJobInvoice = String(cString: job_invoice)
            }else{
                cJobInvoice = ""
            }
            //print(cJobTitle)
            dicRow = ["job_title": cJobTitle,"job_name": cJobName,"job_desc": cJobDesc,"job_other":cJobOther,"job_invoice":cJobInvoice]
            print(dicRow)
            resultJob.append(dicRow)
            //print(resultJob)
        }
        sqlite3_finalize(statement)
    }

    override func numberOfSections(in tableView: UITableView) -> Int {
        // #warning Incomplete implementation, return the number of sections
        return 1
    }
    
    override func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        // #warning Incomplete implementation, return the number of rows
        return resultJob.count
    }
    
    override func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell = tableView.dequeueReusableCell(withIdentifier: "Cell", for: indexPath) as! JobSearchResultTableViewCell
        cell.lblTitle.text = resultJob[indexPath.row]["job_title"] as? String
        cell.lblSubTitle.text = resultJob[indexPath.row]["job_name"] as? String
        cell.lblContent.text = resultJob[indexPath.row]["job_desc"] as? String
        return cell
    }
    
    override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
        if segue.identifier == "toJobDetailVC"{
            let detailVC = segue.destination as! JobDetailViewController
            detailVC.JsrVC = self
            
            if let rowIndex = self.tableView.indexPathForSelectedRow?.row {
                detailVC.selectedRow = rowIndex
            }
        }
    }
    
    override func tableView(_ tableView: UITableView, didSelectRowAt indexPath: IndexPath) {
        
        performSegue(withIdentifier: "toJobDetailVC", sender: nil)
    }
    
    func getResultJob(){
        resultJob = [
            [
                "job_title": "桃園--大江店 全職 安全部門助理幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "1.維護賣場環境及人員安全\n2.維護鄰里機關關係",
                "job_other": "1.具服務熱忱,無不良嗜好,可輪早晚班者\n2.\n3.具相關保全主管經驗者尤佳\n4.須具備消防安全、勞安人員等相關證照\n5.職業軍職退役者尤佳",
                "job_invoice": "22662550"
            ],
            [
                "job_title": "行政管理儲備幹部",
                "job_name": "宏致電子股份有限公司",
                "job_desc": "1.整合集團行政資源；規劃、組織、指導及協調組織內部行政作業\n2.集團各項行政業務管理、督導；工作規劃與執行\n3.熟悉ISO-140000/SA18000;執行、推行、管理、稽核等",
                "job_other": "1.善溝通協調規劃能力\n2.具工作熱忱\n3.須配合公司出差、駐外之安排",
                "job_invoice": "97257738"
            ],
            [
                "job_title": "業務代表",
                "job_name": "南山人壽保險股份有限公司",
                "job_desc": "客戶服務、招攬保險",
                "job_other": "",
                "job_invoice": "11456006"
            ],
            [
                "job_title": "30422 桃園 大江店 全職 全國儲備幹部(生鮮處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
            ],
            [
                "job_title": "C 21025 桃園 中壢店 全國儲備幹部(紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
            ],
            [
                "job_title": "C 21123 桃園 大江店 全國儲備幹部(家庭五金處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
            ],
            [
                "job_title": "儲備幹部",
                "job_name": "高力熱處理工業股份有限公司",
                "job_desc": "1.學習生產設備原理構造.操作\n2.學習生產製程管理.管制.改善\n3.銲接原理\n4.操作板式組立.加壓.進出爐",
                "job_other": "",
                "job_invoice": "35319185"
            ],
            [
                "job_title": "C 21125 桃園 大江店 全國儲備幹部(紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
            ],
            [
                "job_title": "契約工 / 技術員 (日班) _中壢食品廠",
                "job_name": "南僑化學工業股份有限公司",
                "job_desc": "【派遣職】\n工作內容：機台操作、包裝、清潔等生產作業。\n上班時間：07:30~16:00。",
                "job_other": "1. 細心敏捷、配合度高。\n2. 正向思考、無不良嗜好。\n3. 經錄取後須能立即到任。\n4. 願接受公司長期培訓者優先考慮。",
                "job_invoice": "7305506"
            ],
                [
                "job_title": "培訓主任",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "1.辦理客戶理賠，保單貸款 \n2.商品解說及職團駐點服務 \n3.協助主管開拓客源\n4.招攬保險業務",
                "job_other": "1.你是否想找有遠景的工作？ \n2.您是否有滿腹理想卻還沒找到可以發展的舞台？ \n3.您是否因為自己太過優秀被同儕排擠,有志難伸？ \n4.您是否是個熱情奔放，喜好服務人群,卻沒有機會表現？ \n本單位可以為您重新找到真實的自己！具有潛能的自己！具有企圖心的自己！具有熱情的自己！具有優秀基因的自己！具有可以改變未來的自己！歡迎您撥空來了解；再來決定....千萬不要放棄這次機會,因為您的貴人可能就是......... 鼎興團隊 \n1.有什麼行業可以在短期內使你的月收入達到5萬10萬20萬甚至更高，而不需要任何的資本以及負擔任風險？ \n2.有什麼行業可以讓你在３年內接受完整的教育訓練，使你的能力不斷提升，年收入更由於個人的能力達到300萬以上？ \n3.有什麼行業能讓你在短時間內，領導30人、50人的場面，而且又擁有漂亮的辦公室？ \n4.什麼行業可以培養你成為一個領袖人才？ \n5.有什麼行業可以有暢通的晉陞制度，能使你設立明確的目標，預先知道自己在３年後的地位？ \n6.有什麼行業是：只要我努力，我的收入一定會增加？因為完全沒有風險 \n7.有什麼行業可以使你廣結善緣，讓每一個人都很樂意的把它所知道的全告訴你，使你能快速成長？",
                "job_invoice": "3557017"
                ],
                [
                "job_title": "30622 桃園 內壢店 全職 全國儲備幹部(家庭五金.家電.紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "門市幹部(三商巧福- 中壢 -中壢三店)",
                "job_name": "三商投資控股股份有限公司",
                "job_desc": "三商巧福儲備幹部\n1.對餐飲業有熱忱者,願意以積極的信念從基礎培訓開始.\n2.有熱心服務的精神,有心向管理階級挑戰日後成為店長者.\n3.限專科以上畢業者\n4.能配合輪調",
                "job_other": "",
                "job_invoice": "11052709"
                ],
                [
                "job_title": "30422 桃園 大江店 全職 全國儲備幹部(家庭五金.家電.紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21121 桃園 大江店 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "理財規劃人員",
                "job_name": "三商美邦人壽保險股份有限公司",
                "job_desc": "基金投資，節稅規劃，外幣存款，財務規劃，資產配置，全方位理財規劃人員，保證培訓",
                "job_other": "熱忱，行動力求知慾強，有活力並願意接受輔導及通過執照考試",
                "job_invoice": "84443471"
                ],
                [
                "job_title": "C 21022 桃園 中壢店 生鮮儲備幹部-麵包課",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "門市幹部(福勝亭-桃園市-經國店)",
                "job_name": "三商投資控股股份有限公司",
                "job_desc": "福勝亭儲備幹部\n1.對餐飲業有熱忱者,願意以積極的信念從基礎培訓開始.\n2.有熱心服務的精神,有心向管理階級挑戰日後成為店長者.",
                "job_other": "福勝亭儲備幹部\n1.對餐飲業有熱忱者,願意以積極的信念從基礎培訓開始.\n2.有熱心服務的精神,有心向管理階級挑戰日後成為店長者.",
                "job_invoice": "11052709"
                ],
                [
                "job_title": "門市儲備幹部(三商巧福-內壢-中壢休息站)",
                "job_name": "三商投資控股股份有限公司",
                "job_desc": "國道一號中壢休息站，騎摩托車可到\n\n<關於三商巧福> http://www.3375.com.tw/\n<培訓流程> 培訓期→儲備店長→店長\n\n<培訓期>\n1.外場：顧客接待、點餐、收銀、送餐、定時遞補小菜及調味料、桌面清潔、維持用餐環境整潔、當日帳款結清\n2.內場：食材整理準備、依標準作業烹調餐點、餐具清潔整理、出餐時間及順序控管、內場環境清潔整理、食材冷藏\n<門市店長>\n1. 門市日常營運管理\n2. 業績目標達成\n3. 人員管理、培訓及排班\n4. 費用及食材進貨控管\n5. 落實標準化作業\n6. 顧客服務及客訴處理\n7. 總公司訊息及政策佈達",
                "job_other": "",
                "job_invoice": "11052709"
                ],
                [
                "job_title": "勞保年金專員",
                "job_name": "宏泰人壽保險股份有限公司",
                "job_desc": "因應勞保年金及國民年金於97/10及98/01起實施，儲蓄退休及養老是目前最具前瞻性的話題，宏泰提供客戶達到此目標的最佳商品，概念，品質與服務。同時更提供您優厚且長期的收入來源\n年金商品將會是未來保險業的主流商品，如果能了解年金的理論與應用，並且把握年金的銷售方法，那將會是您一輩子的收入來源，更是您晉升千萬年薪的重要機會\n目前市場尚缺大量優秀的專業年金銷售人員，希望優秀的您可以立即加入我們，一起開發這個廣大的市場",
                "job_other": "",
                "job_invoice": "84894313"
                ],
                [
                "job_title": "C 21224 桃園 中原店 全國儲備幹部(家電處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21122 桃園 大江店 生鮮儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n願接受肉品.水產.麵包.熟食.蔬果專業訓練者優先錄用\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "品保儲備幹部_中壢",
                "job_name": "南僑化學工業股份有限公司",
                "job_desc": "品保相關任務執行。\n*上班時間：15：50~00：20",
                "job_other": "1. 5年以上工作經驗，具備微生物操作及食品實驗操作能力。\n2. 具備食品技師經驗尤佳，曾任管理職者優先考慮\n3. 具耐心及責任感，能獨立作業。",
                "job_invoice": "7305506"
                ],
                [
                "job_title": "桃園--中原店 全職 生鮮儲備營業經理 (麵包課)",
                "job_name": "家福股份有限公司",
                "job_desc": "1. 麵包、西點蛋糕製作\n2. 部門人員訓練與管理\n3. 部門工作管理\n4. 協助營業經理處理部門事務",
                "job_other": "1.能配合不定期加班\n2.能配合輪休\n3.抗壓性高\n4.具相關主管經驗2年以上",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "桃竹苗區 全職 儲備營業經理 (家用五金處)",
                "job_name": "家福股份有限公司",
                "job_desc": "1. 部門營運績效管理\n2. 部門人員訓練及管理",
                "job_other": "1. 須配合工作地點的輪調\n2. 須具備3年以上家用品、園藝、汽車、休閒等商品管理及銷售經驗\n2. 須具備百貨量販主管經驗1年以上\n3. 熱愛服務業，具服務熱忱\n4. 具強烈企圖心、責任感及高EQ",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "契約工 / 技術員 (中班) _中壢食品廠",
                "job_name": "南僑化學工業股份有限公司",
                "job_desc": "【派遣職】\n工作內容：機台操作、包裝、清潔等生產作業。\n上班時間：15:50~00:20",
                "job_other": "1. 高中以上，不限科系。\n2. 細心敏捷、配合度高。\n3. 正向思考、無不良嗜好。\n4. 經錄取後須能立即到任。\n5. 願接受公司長期培訓者優先考慮。",
                "job_invoice": "7305506"
                ],
                [
                "job_title": "總經理室專員",
                "job_name": "大東紡織股份有限公司",
                "job_desc": "擔任總經理幕僚工作,負責經營與營運績效資訊分析.",
                "job_other": "應具備條件:\n1. 會計.企管商學相關知識\n2. 熟悉成本會計及經營分析\n3. 個性積極主動\n4.具良好溝通能力及組織能力\n5. 具有學習與服務熱忱",
                "job_invoice": "51037304"
                ],
                [
                "job_title": "C 21223 桃園 中原店 全國儲備幹部(家庭五金處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "30522 桃園 中原店 全職 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "製造部儲備幹部",
                "job_name": "悅城科技股份有限公司",
                "job_desc": "1.工作及產能安排\n2.現場管理\n3.日常處理與回報\n4.水電器設備管制\n5.上級特別指示及要求",
                "job_other": "1.製造業單位主管3年以上經驗 2.熟悉相關光電產業製程 3.有撰寫SOP能力 4.有會計概念能計算工時、成本 5.有簡報、教育部屬能力 6.基本品質改善手法-例QC七大手法 7.具ITO製程相關經驗佳",
                "job_invoice": "27340208"
                ],
                [
                "job_title": "儲備人員(中壢)",
                "job_name": "國產建材實業股份有限公司",
                "job_desc": "本職工作地點：中壢及新竹地區",
                "job_other": "個性積極、勤奮、肯學習，對業務、品管或生產管理有興趣，\n願意接受公司全方位培訓及工作輪調者．",
                "job_invoice": "24060203"
                ],
                [
                "job_title": "專案儲備主管",
                "job_name": "中國人壽保險股份有限公司",
                "job_desc": "◎【專案儲備襄理】培訓一職 ◎\n工作時間：\n每日早上8點30分至下午5點30分，週休二日。\n工作內容：\n按學經歷相關條件面議。\n工作收入及福利：\n半年內，每月1.5~2萬額外培訓補助\n半年後，符合者加發超額獎金合計約13萬\n滿一年符合者，另加發財務補助金20萬\n光獎金部份約領42萬，\n薪水部份另計，合領年薪約95萬\n享勞健保、結婚津貼、生育補助、\n年終獎金、績效獎金、退休公積金\n可享每年兩次國外旅遊",
                "job_other": "",
                "job_invoice": "3434016"
                ],
                [
                "job_title": "C 21222 桃園 中原店 北南區 儲備幹部(生鮮處/收銀課/安全課)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n願接受肉品.水產.麵包.熟食.蔬果專業訓練者優先錄用\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "行銷業務人員",
                "job_name": "中國人壽保險股份有限公司",
                "job_desc": "推廣業務、壽險理財規劃",
                "job_other": "1.無經驗者皆可，備有完善新人培訓計劃輔導考取專業證照。\n2.有人身保險業務員及投資商品認證者佳",
                "job_invoice": "3434016"
                ],
                [
                "job_title": "組訓專員",
                "job_name": "中國人壽保險股份有限公司",
                "job_desc": "對象：\nA.專科(含)以上學校畢業或同等學歷者。\nB.一年(含)以上工作經驗。\n待遇：完善培訓津貼與豐厚的財務獎金，符合規定即可成為正式培訓主管。\n工作內容：\nA.輔助主管招募事宜及替新人安排相關定著訓練。\nB.準備新進人員上課資料及安排初階培訓課程。\nC.協助新進人員報名考試及輔導考取基本證照。\nD.督導新進人員與人資助理完成每日基本工作量。",
                "job_other": "",
                "job_invoice": "3434016"
                ],
                [
                "job_title": "金融潛能開發培訓專案儲備幹部",
                "job_name": "富邦人壽保險股份有限公司",
                "job_desc": "",
                "job_other": "活潑、熱情、具親和力",
                "job_invoice": "27935073"
                ],
                [
                "job_title": "C 21124 桃園 大江店 全國儲備幹部(家電處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "人力資源策略專員/ Business HR (中壢)",
                "job_name": "台達電子工業股份有限公司",
                "job_desc": "1.提供事業群人力資源諮詢及全方位解決方案。\n2.診斷分析組織能力。\n3.規劃組織人力發展計畫並執行。",
                "job_other": "1. 主動積極、反應敏捷\n2. 問題分析解決能力強\n3. 善溝通協調、學習能力強\n4. 熟悉產業發展/經營運作\n5. 五年以上業務或人資經驗",
                "job_invoice": "34051920"
                ],
                [
                "job_title": "投資理財規劃專員",
                "job_name": "三商美邦人壽保險股份有限公司",
                "job_desc": "提供客戶理財投資規劃/國內外基金/連動式債卷/企業年金",
                "job_other": "熱忱，行動力求知慾強，有活力並願意接受輔導及通過執照考試",
                "job_invoice": "84443471"
                ],
                [
                "job_title": "C 21023 桃園 中壢店 全國儲備幹部(家庭五金處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "儲備幹部(認證編號099HA0003)",
                "job_name": "國泰人壽保險股份有限公司",
                "job_desc": "",
                "job_other": "",
                "job_invoice": "3374707"
                ],
                [
                "job_title": "C 21027 桃園 中壢店 收銀服務儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售業服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "00922 總公司 全職 購物中心北南區營運專員(樓管)",
                "job_name": "家福股份有限公司",
                "job_desc": "樓面管理:\n1.租戶廠商進撤場工作協調\n2.基地台、ATM進場協助確認公共區域清潔\n3.負責餐飲櫃位之衛生稽核\n4.稽核美食街廠商使用之制式備品\n5.做為租戶及店端與購物中心之間的聯絡管道\n6.租戶員工現場管理\n7.租戶之應收帳款收取及現金投庫\n8.收銀設備管理",
                "job_other": "1.具百貨樓管經驗者佳 \n2.有責任心、活潑外向\n3.此職務需時常外出至各店\n4.具溝通協調能力",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "儲備主管BEST專案人員(三)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "1.負責招攬公司業務\n2.客戶理財諮詢與規劃\n3.稅務規劃與計畫\n4.售後服務、理賠案件處理",
                "job_other": "高中職以上畢業\n幽默、風趣、會講笑話佳\n負責團體保險業務，數名無經驗可，大專以上公司提供完整訓練，輔導考照並享優渥津貼，歡迎學習能力強，態度積極、想成為全方位理財人員的你，加入第一名及最具有團保開發經驗的公司。\n1~2年以上工作經驗\n工作時間:依公司規定",
                "job_invoice": "3557017"
                ],
                [
                "job_title": "桃竹苗區--全職 生鮮儲備營業經理 (麵包課/肉課/鮮魚課/蔬果課/熟食課)",
                "job_name": "家福股份有限公司",
                "job_desc": "1. 部門績效經營管理\n2. 部門人員工作訓練及管理",
                "job_other": "1. 須配合工作地點的輪調\n2. 應徵魚課、肉課和蔬果課儲備營業經理者，須具備百貨、量販、超商等相關生鮮主管經驗1年以上\n3. 應徵熟食課儲備營業經理者須具備百貨、量販、超商或飯店主廚等熟食主管經驗1年以上\n4. 應徵麵包課儲備營業經理者，須具備麵包師父3年以上經驗\n5. 具相關證照者尤佳",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "經營管理儲備幹部(台灣.中國)-熱交換器",
                "job_name": "高力熱處理工業股份有限公司",
                "job_desc": "1.制定與執行年度預算預算達成\n2.市場調查.開發.事業部門規劃.整合.管理\n3.建購銷售.生產.研發.售後服務完整團隊\n4.預測市場脈動.市場營運與分析\n5.重大案件與客戶管理\n6.銷售通路與業務句點設立與建購",
                "job_other": "",
                "job_invoice": "35319185"
                ],
                [
                "job_title": "X4500高鐵站營運組長(桃竹地區)",
                "job_name": "中興電工機械股份有限公司",
                "job_desc": "停車場責任場站營運",
                "job_other": "具管理經驗(服務業管理經驗尤佳)，基本文書處理，電腦應用",
                "job_invoice": "33029464"
                ],
                [
                "job_title": "C 21122 桃園 大江店 北南區 儲備幹部(生鮮處/收銀課/安全課)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n願接受肉品.水產.麵包.熟食.蔬果專業訓練者優先錄用\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "社會新鮮人",
                "job_name": "安聯人壽保險股份有限公司",
                "job_desc": "1.培育一個月、完成訓練並且考取證照\n2.一個月考取證照提供就職補助金5000元\n3.正式任用後合約另定",
                "job_other": "",
                "job_invoice": "89283591"
                ],
                [
                "job_title": "(CNN評選名店-品川蘭)-儲備幹部(桃園中壢)",
                "job_name": "三商投資控股股份有限公司",
                "job_desc": "<培訓期>\n1.內場：顧客接待、收餐、送餐、桌面清潔、環境整理\n2.內場：準備食材並協助料理佳餚、廚房環境清潔與清潔管理\n專業能力培訓：人事、訓練、貨管、採購、店務\n培訓期: 約6-12個月\n\n<升遷規劃>\n儲備幹部->儲備店長->副店長->主廚->店經理",
                "job_other": "1.對餐飲業有熱忱，個性活潑外向，樂與人互動\n2.認真、負責、學習意願高\n3.有心向管理階級挑戰者.\n4.能接受早晚輪班&門市輪調\n5.有餐飲經驗者佳",
                "job_invoice": "11052709"
                ],
                [
                "job_title": "主任/區經理/處經理(三)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "具金融保險主管經驗，歡迎壽險業務主管加入，公司提供優渥專案獎金。\n熱情、積極、有自信但不滿於現狀者，歡迎向數百萬年薪挑戰。\n負責招攬公司業務(壽險及產險)。",
                "job_other": "高中職以上畢業。\n1.福利制度：\n前9個月每月補助訓練津貼，另有達成獎金、每月業績獎金、季獎金、年終獎金及績優人員出國獎勵。\n2.教育訓練：\n先於桃園區部集中，以分梯、分月、分階段實施教育訓練，包括新人研修班、投資型商品班、主管養成班等，一系列完善的專業培訓，協助成為全方位金融理財人員。\n3.幽默、風趣、會講笑話佳。\n4.1~2年以上工作經驗。\n5.有專案補助。",
                "job_invoice": "3557017"
                ],
                [
                "job_title": "*急徵*門市儲備幹部(桃園縣-中壢市)",
                "job_name": "全國電子股份有限公司",
                "job_desc": "1.介紹及銷售門市家電及3C資訊等商品 \n2.提供顧客之接待與需求服務\n3.提供透明、暢通升遷管道\n4.本公司備有專業教育訓練\n5.休假福利:月休9-10天～排休制",
                "job_other": "1.具備家電3C商品銷售或服務業經驗者佳，無經驗亦可\n2.能配合門市排班排假\n3.分配門市以距離住家騎機車40分鐘以內門市為主\n4.採統一面試日期將另行通知",
                "job_invoice": "22006252"
                ],
                [
                "job_title": "30422 桃園 大江店 全職 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21327 桃園 內壢店 收銀服務儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售業服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21024 桃園 中壢店 全國儲備幹部(家電處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "IPO事業部儲備幹部",
                "job_name": "錩新科技股份有限公司",
                "job_desc": "1.客戶開發\n2.新產品／新市場開發\n3.專案業務",
                "job_other": "1.具獨立作業能力\n2.需配合海外出差\n3.具備品質管理稽核相關知識\n4.5年業務主管經驗",
                "job_invoice": "44913118"
                ],
                [
                "job_title": "製造部-工程師(儲備人力)",
                "job_name": "悅城科技股份有限公司",
                "job_desc": "1.協助製造部相關事務處理、跟催\n2.會議待辦事項追踪\n3.製造部課內帳務處理\n4.專案、產能-規劃進行、計算\n4.具抗壓性、能積極主動執行交辦事項\n5.具溝通能力、思路清晰、有邏輯概念\n6.配合度高且能配合加班",
                "job_other": "1.生產單位人員管理2年以上\n2.高配合度,高執行力\n3.光電或PCB相關經驗者佳\n4.有責任心、企圖心\n5.抗壓性高",
                "job_invoice": "27340208"
                ],
                [
                "job_title": "主任/區經理/處經理(二)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "具金融保險主管經驗，歡迎壽險業務主管加入，公司提供優渥專案獎金。\n熱情、積極、有自信但不滿於現狀者，歡迎向數百萬年薪挑戰。\n負責招攬公司業務(壽險及產險)。",
                "job_other": "高中職以上畢業。\n1.福利制度：\n前9個月每月補助訓練津貼，另有達成獎金、每月業績獎金、季獎金、年終獎金及績優人員出國獎勵。\n2.教育訓練：\n先於桃園區部集中，以分梯、分月、分階段實施教育訓練，包括新人研修班、投資型商品班、主管養成班等，一系列完善的專業培訓，協助成為全方位金融理財人員。\n3.幽默、風趣、會講笑話佳。\n4.1~2年以上工作經驗。\n5.有專案補助。",
                "job_invoice": "3557017"
                ],
                [
                "job_title": "門市銷售經理（店長）",
                "job_name": "勁永國際股份有限公司",
                "job_desc": ".負責介紹及銷售門市商品。\n2.提供顧客接待服務（如：電話諮詢、調貨、修改、包裝及退換貨等店務處理），包括內、外勤工作。\n3.整理貨架及維持店櫃週遭之整潔。\n4.負責店內日常事務（如：營業結算、進貨入庫、庫存點算等店務），進行商品包裝、陳列及促銷品換檔工作。\n5.提供產品售後服務。\n6.負責商品銷售管理及客戶關係經營管理。\n7.傳達公司、經銷商訊息。",
                "job_other": ". 對門市銷售工作有興趣之人才。\n2. 具服務熱誠，與適應快速變化環境之能力。\n3. 具高抗壓性，勇於接受挑戰，誠信，團隊合作。",
                "job_invoice": "16294733"
                ],
                [
                "job_title": "C 21022 桃園 中壢店 北南區 儲備幹部(生鮮處/收銀課/安全課)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n願接受肉品.水產.麵包.熟食.蔬果專業訓練者優先錄用\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "信用卡駐點行銷專員",
                "job_name": "富邦人壽保險股份有限公司",
                "job_desc": "各種金融商品之諮詢與行銷",
                "job_other": "",
                "job_invoice": "27935073"
                ],
                [
                "job_title": "人力資源策略主管/Business HR(中壢)",
                "job_name": "台達電子工業股份有限公司",
                "job_desc": "1.提供事業群人力資源諮詢及全方位解決方案。\n2.診斷分析組織能力。\n3.規劃組織人力發展計畫並執行。",
                "job_other": "1. 主動積極、反應敏捷\n2. 問題分析解決能力強\n3. 善溝通協調、學習能力強\n4. 熟悉產業發展/經營運作\n5. 十年以上業務或人資經驗\n6. 具備電子大廠經驗佳",
                "job_invoice": "34051920"
                ],
                [
                "job_title": "C 21324 桃園 內壢店 全國儲備幹部(家電處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21321 桃園 內壢店 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "主任/區經理/處經理(一)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "具金融保險主管經驗，歡迎壽險業務主管加入，公司提供優渥專案獎金。\n熱情、積極、有自信但不滿於現狀者，歡迎向數百萬年薪挑戰。\n負責招攬公司業務(壽險及產險)。",
                "job_other": "高中職以上畢業。\n1.福利制度：\n前9個月每月補助訓練津貼，另有達成獎金、每月業績獎金、季獎金、年終獎金及績優人員出國獎勵。\n2.教育訓練：\n先於桃園區部集中，以分梯、分月、分階段實施教育訓練，包括新人研修班、投資型商品班、主管養成班等，一系列完善的專業培訓，協助成為全方位金融理財人員。\n3.幽默、風趣、會講笑話佳。\n4.1~2年以上工作經驗。\n5.有專案補助。",
                "job_invoice": "3557017"
                ],
                [
                "job_title": "30522 桃園 中原店 全職 全國儲備幹部(家庭五金.家電.紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "業務行銷專員",
                "job_name": "富邦人壽保險股份有限公司",
                "job_desc": "各種金融商品之諮詢與行銷",
                "job_other": "",
                "job_invoice": "27935073"
                ],
                [
                "job_title": "C 21225 桃園 中原店 全國儲備幹部(紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "30322 桃園 中壢店 全職 全國儲備幹部(生鮮處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21325 桃園 內壢店 全國儲備幹部(紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21022 桃園 中壢店 生鮮儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n願接受肉品.水產.麵包.熟食.蔬果專業訓練者優先錄用\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "主任/區經理/處經理(四)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "具金融保險主管經驗，歡迎壽險業務主管加入，公司提供優渥專案獎金。\n熱情、積極、有自信但不滿於現狀者，歡迎向數百萬年薪挑戰。\n負責招攬公司業務(壽險及產險)。",
                "job_other": "高中職以上畢業。\n1.福利制度：\n前9個月每月補助訓練津貼，另有達成獎金、每月業績獎金、季獎金、年終獎金及績優人員出國獎勵。\n2.教育訓練：\n先於桃園區部集中，以分梯、分月、分階段實施教育訓練，包括新人研修班、投資型商品班、主管養成班等，一系列完善的專業培訓，協助成為全方位金融理財人員。\n3.幽默、風趣、會講笑話佳。\n4.1~2年以上工作經驗。\n5.有專案補助。",
                "job_invoice": "3557017"
                ],
                [
                "job_title": "(CNN評選名店-品川蘭)-儲備店長(桃園中壢)",
                "job_name": "三商投資控股股份有限公司",
                "job_desc": "<培訓期>\n1.內場：顧客接待、收餐、送餐、桌面清潔、環境整理\n2.內場：準備食材並協助料理佳餚、廚房環境清潔與清潔管理\n專業能力培訓：人事、訓練、貨管、採購、店務\n培訓期: 約2-3個月\n\n<升遷規劃>\n儲備幹部->儲備店長->副店長->主廚->店經理",
                "job_other": "須具餐飲相關管理經驗備2年以上",
                "job_invoice": "11052709"
                ],
                [
                "job_title": "行政專員(中壢廠)",
                "job_name": "聯華食品工業股份有限公司",
                "job_desc": "1.產品研發績效彙整及異常追蹤/主檔資料檢核\n2.月/年報告編制\n3.部門庶務資料收集管理\n4.協助資訊系統SOP檔案管理\n5.其餘主管交辦事項",
                "job_other": "1.具備會計知識背景者佳",
                "job_invoice": "7569627"
                ],
                [
                "job_title": "人事課儲備幹部",
                "job_name": "悅城科技股份有限公司",
                "job_desc": "1.人資相關作業經驗2年以上\n2.主動積極,擅溝通協調及專隊合作\n3.了解公司形象塑造之行銷,企劃能力\n4.個性細心,抗壓性高\n5.熟悉勞基法及相關法令規定",
                "job_other": "熟excel,word電腦操作",
                "job_invoice": "27340208"
                ],
                [
                "job_title": "C 21127 桃園 大江店 收銀服務儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售業服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "儲備主管BEST專案人員(一)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "1.負責招攬公司業務\n2.客戶理財諮詢與規劃\n3.稅務規劃與計畫\n4.售後服務、理賠案件處理",
                "job_other": "高中職以上畢業\n幽默、風趣、會講笑話佳\n負責團體保險業務，數名無經驗可，大專以上公司提供完整訓練，輔導考照並享優渥津貼，歡迎學習能力強，態度積極、想成為全方位理財人員的你，加入第一名及最具有團保開發經驗的公司。\n1~2年以上工作經驗\n工作時間:依公司規定",
                "job_invoice": "3557017"
                ],
                [
                "job_title": "勞保年金規劃顧問",
                "job_name": "宏泰人壽保險股份有限公司",
                "job_desc": "因應勞保年金及國民年金於97/10及98/01起實施，儲蓄退休及養老是目前最具前瞻性的話題，宏泰提供客戶達到此目標的最佳商品，概念，品質與服務。同時更提供您優厚且長期的收入來源\n年金商品將會是未來保險業的主流商品，如果能了解年金的理論與應用，並且把握年金的銷售方法，那將會是您一輩子的收入來源，更是您晉升千萬年薪的重要機會\n目前市場尚缺大量優秀的專業年金銷售人員，希望優秀的您可以立即加入我們，一起開發這個廣大的市場",
                "job_other": "",
                "job_invoice": "84894313"
                ],
                [
                "job_title": "儲備幹部",
                "job_name": "大東紡織股份有限公司",
                "job_desc": "1.基層主管人員培訓\n2.未來管理幹部培訓",
                "job_other": "",
                "job_invoice": "51037304"
                ],
                [
                "job_title": "C 21021 桃園 中壢店 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "門市儲備幹部(三商巧福-桃園縣-中壢三店)",
                "job_name": "三商投資控股股份有限公司",
                "job_desc": "<關於三商巧福> http://www.3375.com.tw/\n<培訓流程> 培訓期→儲備店長→店長\n\n<培訓期>\n1.外場：顧客接待、點餐、收銀、送餐、定時遞補小菜及調味料、桌面清潔、維持用餐環境整潔、當日帳款結清\n2.內場：食材整理準備、依標準作業烹調餐點、餐具清潔整理、出餐時間及順序控管、內場環境清潔整理、食材冷藏\n<門市店長>\n1. 門市日常營運管理\n2. 業績目標達成\n3. 人員管理、培訓及排班\n4. 費用及食材進貨控管\n5. 落實標準化作業\n6. 顧客服務及客訴處理\n7. 總公司訊息及政策佈達",
                "job_other": "",
                "job_invoice": "11052709"
                ],
                [
                "job_title": "契約工 / 技術員 (夜班) _中壢食品廠",
                "job_name": "南僑化學工業股份有限公司",
                "job_desc": "【派遣職】\n工作內容：機台操作、包裝、清潔等生產作業。\n上班時間：20:00-04:30。",
                "job_other": "1. 細心敏捷、配合度高。\n2. 正向思考、無不良嗜好。\n3. 經錄取後須能立即到任。\n4. 願接受公司長期培訓者優先考慮。",
                "job_invoice": "7305506"
                ],
                [
                "job_title": "30322 桃園 中壢店 全職 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "製造部課長",
                "job_name": "悅城科技股份有限公司",
                "job_desc": "1.人員管理\n2.產量目標\n3.品質目標\n4.單位成本控管",
                "job_other": "1.管理實務經驗3年以上\n2.管理人數40人以上\n3.光電產業尤佳",
                "job_invoice": "27340208"
                ],
                [
                "job_title": "業務儲備幹部",
                "job_name": "炎洲股份有限公司",
                "job_desc": "1.各式包裝材料銷售\n2.專案式中大型客戶開發\n3.儲備業務培訓人才主管\n\n工作待遇：底薪+獎金\n工作地點：泰山總部受訓後,將分發至桃園以北之門市上班",
                "job_other": "1.具完整的產業業務經驗\n2.業務開發與陌生拜訪經驗\n3.有完整產業別專業產品銷售推廣經驗",
                "job_invoice": "35894259"
                ],
                [
                "job_title": "C 21222 桃園 中原店 全職 生鮮儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 桃園地區各分店",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "財務安全規劃師(三)",
                "job_name": "富邦人壽保險股份有限公司",
                "job_desc": "",
                "job_other": "",
                "job_invoice": "27935073"
                ],
                [
                "job_title": "中壢廠儲備幹部",
                "job_name": "力麗企業股份有限公司",
                "job_desc": "",
                "job_other": "需輪班",
                "job_invoice": "7663290"
                ],
                [
                "job_title": "肉品專櫃儲備店長(SOGO中壢店)",
                "job_name": "大成長城企業股份有限公司",
                "job_desc": "1.熟食販售\n2.作業場環境清潔\n3.有食品販售相關經驗者佳\n4.地點: 桃園縣中壢市元化路357號B1F(台北sogo百貨忠孝店)",
                "job_other": "",
                "job_invoice": "73008303"
                ],
                [
                "job_title": "30325 桃園 中壢店 全職 全國儲備幹部(安全課)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "S契約核保科主管(桃竹)",
                "job_name": "中國人壽保險股份有限公司",
                "job_desc": "1.核保作業審核及複核。\n2.核保人員作業訓練及督導。\n3.各項核保作業通路之宣導。",
                "job_other": "1.熟悉核保系統操作3年以上經驗。\n2.擔任實際核保作業6年以上經驗(醫務核保3年以上)。\n3.曾擔任核保主管1年/核保規則規範訂定2年/其他管理職3年以上經驗。",
                "job_invoice": "3434016"  
                ],
                [
                "job_title": "菁英計劃育成人員",
                "job_name": "安聯人壽保險股份有限公司",
                "job_desc": "一、協助客戶規劃人生風險及財務風險控管計畫\n二、協助客戶退休金規畫\n三、協助客戶在海、內外共同基金投資的建議輔助",
                "job_other": "有金融經驗者佳",
                "job_invoice": "89283591"
                ],
                [
                "job_title": "儲備主管BEST專案人員(四)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "1.負責招攬公司業務\n2.客戶理財諮詢與規劃\n3.稅務規劃與計畫\n4.售後服務、理賠案件處理",
                "job_other": "高中職以上畢業\n幽默、風趣、會講笑話佳\n負責團體保險業務，數名無經驗可，大專以上公司提供完整訓練，輔導考照並享優渥津貼，歡迎學習能力強，態度積極、想成為全方位理財人員的你，加入第一名及最具有團保開發經驗的公司。\n1~2年以上工作經驗\n工作時間:依公司規定",
                "job_invoice": "3557017"  
                ],
                [
                "job_title": "儲備主管BEST專案人員(二)",
                "job_name": "臺灣人壽保險股份有限公司",
                "job_desc": "1.負責招攬公司業務\n2.客戶理財諮詢與規劃\n3.稅務規劃與計畫\n4.售後服務、理賠案件處理",
                "job_other": "高中職以上畢業\n幽默、風趣、會講笑話佳\n負責團體保險業務，數名無經驗可，大專以上公司提供完整訓練，輔導考照並享優渥津貼，歡迎學習能力強，態度積極、想成為全方位理財人員的你，加入第一名及最具有團保開發經驗的公司。\n1~2年以上工作經驗\n工作時間:依公司規定",
                "job_invoice": "3557017"  
                ],
                [
                "job_title": "30322 桃園 中壢店 全職 全國儲備幹部(家庭五金.家電.紡織處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "處經理",
                "job_name": "安聯人壽保險股份有限公司",
                "job_desc": "1.有保險業2年以上的處經理經驗\n2.做組織發展及培育管理\n3.配合公司長遠的業務推動\n4.編寫預算項目及費用，並參與預算審核會議。\n5.觀察、瞭解顧客的偏好，以決定未來銷售的重點。",
                "job_other": "",
                "job_invoice": "89283591"
                ],
                [
                "job_title": "C 21322 桃園 內壢店 生鮮儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n願接受肉品.水產.麵包.熟食.蔬果專業訓練者優先錄用\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "業務助理(外勤)",
                "job_name": "中國人壽保險股份有限公司",
                "job_desc": "簡單操作電腦、收發E-mail、電話通知及協助文書相關工作",
                "job_other": "",
                "job_invoice": "3434016"  
                ],
                [
                "job_title": "烘焙技術員(中壢)",
                "job_name": "南僑化學工業股份有限公司",
                "job_desc": "1. 上班時間 07:30~16:30。\n2. 協助烘焙作業。\n3. 現場支援機台操作。\n4. 機台清潔維護。",
                "job_other": "1. 食品相關科系佳\n2. 能獨立進行烘焙作業",
                "job_invoice": "7305506"  
                ],
                [
                "job_title": "桃園--大江店 全職  安全儲備主管 (安全課)",
                "job_name": "家福股份有限公司",
                "job_desc": "1.警衛安全人員管理\n2.賣場安全管理及維護\n3.週邊鄰里、相關政府單位關係聯繫\n4.消防安全管理\n5.清潔衛生管理\n具保全相關主管經驗佳",
                "job_other": "1.求職者須檢具『良民證』\n2.認真、負責\n3.抗壓性高\n4.溝通協調能力佳\n5.能配合工作地點的輪調\n6.具消防人員或勞安人員乙級證照者尤佳",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "桃竹苗區 儲備營業經理 (生鮮處)",
                "job_name": "家福股份有限公司",
                "job_desc": "1. 部門營運管理\n2. 部門人員工作訓練及管理\n3. 生鮮品質維護及控管\n4. 需求人員：\n (1)魚課：2人，須具備生鮮賣場或魚市等魚類海鮮商品管理經驗及熟練刀工\n (2)蔬果課：2人，須具備生鮮蔬果賣場商品管理及銷售經驗，及熟識蔬果\n (3)麵包課：2人，須具備麵包西點蛋糕商品製作及管理經驗，具烘焙證照者尤佳\n (4)精肉課：2人，須具備生鮮賣場及肉品市場等商品管理經驗，具熟練刀工",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "30622 桃園 內壢店 全職 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "輪班儲備幹部",
                "job_name": "大東紡織股份有限公司",
                "job_desc": "1.綜理有關生產、效率、品質之控管\n2.生產線人員調度安排，執行上級交辦事項",
                "job_other": "1.可配合輪班者",
                "job_invoice": "51037304"
                ],
                [
                "job_title": "C 21221 桃園 中原店 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "30622 桃園 內壢店 全職 全國儲備幹部(生鮮處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21322 桃園 內壢店 北南區 儲備幹部(生鮮處/收銀課/安全課)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n願接受肉品.水產.麵包.熟食.蔬果專業訓練者優先錄用\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "C 21323 桃園 內壢店 全國儲備幹部(家庭五金處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "保險業務人員",
                "job_name": "三商美邦人壽保險股份有限公司",
                "job_desc": "招攬保單、客戶服務。",
                "job_other": "",
                "job_invoice": "84443471"
                ],
                [
                "job_title": "門市儲備幹部(桃園縣市全部-中壢市)",
                "job_name": "全國電子股份有限公司",
                "job_desc": "電器、家電、電腦、3C通訊產品銷售",
                "job_other": "1.需具備家電3C商品銷售或服務業經驗，大學畢業者優先。\n2.男女不拘。\n3.採統一面試日期將另行通知。",
                "job_invoice": "22006252"
                ],
                [
                "job_title": "30622 桃園 內壢店 全職 全國儲備幹部(雜貨處)",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售餐飲服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練\n工作地點:家樂福 新北市.桃竹區各分店\n郵寄履歷地址:桃園市經國路369號",
                "job_other": "",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "品牌形象企劃營運人員",
                "job_name": "葡萄王生技股份有限公司",
                "job_desc": "1.\t負責觀光工廠實體與虛擬活動企劃、執行與主持\n2.\t觀光工廠各項營運事項管理\n3.\t負責觀光工廠之導覽與解說服務\n4.\t負責觀光工廠營運前期規劃及行政作業\n5.\t負責旅行社或外部個人與團體之各項參觀、預約與接洽事宜處理\n6.\t拓展各式營運通路以增加參觀人次\n7.\t協助公司各項行銷活動規劃與執行\n8.\t其他主管交辦事項",
                "job_other": "1.\t具觀光工廠或門市活動企劃經驗者佳\n2.\t具業務拓展或會員通路經驗者佳\n3.\t積極正向與認真負責者\n4.\t能獨當一面與團隊合作者\n5.\t熟Word、Excel、PowerPoint等電腦文書操作者\n6.\t具財務、成本與數字分析能力者",
                "job_invoice": "11880517"
                ],
                [
                "job_title": "儲備幹部",
                "job_name": "三商美邦人壽保險股份有限公司",
                "job_desc": "招攬保單、客戶服務",
                "job_other": "熱於與人交往，個性積極願挑戰高薪，行動力求知慾強\n有活力並願意接受輔導及通過執照考試",
                "job_invoice": "84443471"
                ],
                [
                "job_title": "品保部培訓儲備幹部",
                "job_name": "宏致電子股份有限公司",
                "job_desc": "1.負責公司品管體系的建立，對出現的各種質量問題進行跟蹤處理。\n2.改善產品信賴度、可靠性、品質，進而全面提升產品品質。\n3.負責ISO體制之推行、供應商IQC管理，以及製品IPQC及OQC管理。\n4.推行並落實QA管理制度，以及規劃品質系統相關之教育訓練。\n5.主導內部稽核活動及外部認證，監督及管理TQM執行成效。\n6.客訴處理、各廠事務溝通協調、業務交辦事像處理、廠內及供應商異常處理、供應商稽核、外部稽核",
                "job_other": "",
                "job_invoice": "97257738"
                ],
                [
                "job_title": "保誠新秀人員",
                "job_name": "中國人壽保險股份有限公司",
                "job_desc": "1.專案培訓期間,每月達責任額標準發送津貼+承纜獎金,並有超額獎金補助,並減低新人的生活壓力,進而虛心學習\n2.專案超額獎金,可激發新人的潛能達成晉附主管的目標\n3.各職級達成獎勵競賽每年可享2次出國之機會,可增廣見聞,體驗新生活",
                "job_other": "具有強烈的企圖心,願向高薪挑戰者,歡迎洽詢",
                "job_invoice": "3434016"  ],
                [
                "job_title": "桃園 內壢店 全職 勞安人員(安全課)",
                "job_name": "家福股份有限公司",
                "job_desc": "1.維護賣場環境及人員安全\n2.維護鄰里機關關係\n3.勞工環境衛生安全督導及稽核\n4.須配合輪班輪休",
                "job_other": "1.具服務熱忱,無不良嗜好,可輪早晚班者\n2.\n3.具相關保全主管經驗者或職業軍職退役者尤佳\n4.須具備勞安乙級證照",
                "job_invoice": "22662550"
                ],
                [
                "job_title": "業務儲備幹部(中壢)",
                "job_name": "國產建材實業股份有限公司",
                "job_desc": "1.業務開發及帳務管理\n2.客戶服務及工地出貨安排\n3.大陸地區業務人員管理督導",
                "job_other": "1.大專以上教育程度(土木科系尤佳),熟OFFICE作業系統\n2.有業務工作經驗並具業務管理能力者佳\n3.具談判能力,擅溝通協調,抗壓性高,能獨立作業者\n4.個性主動.積極.負責\n5.培訓期間工作地點為桃園縣中壢市\n6.未來能派駐大陸者佳",
                "job_invoice": "24060203"
                ],
                [
                "job_title": "C 21227 桃園 中原店 收銀服務儲備幹部",
                "job_name": "家福股份有限公司",
                "job_desc": "-樂於溝通,喜好挑戰及勇於解決問題\n-配合輪班及工作輪調\n-具零售業服務經驗者佳\n-幫助顧客和消費者能每天享受優質的生活,成為家樂福品牌的親善大使\n\n公司提供完整及健全的賣場經營管理訓練",
                "job_other": "",
                "job_invoice": "22662550"
                ]
                ]
        
        
    }
    
}
